---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.Suffix
source: html/fd68a412-172e-ed28-f4f1-554b51ff7188.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.Suffix Property

The suffix for this parameter

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null